// Функция для продолжения чтения
function continueReading() {
    alert("Вы продолжили читать книгу. Следующая глава - На закате, когда солнце начало медленно опускаться за горизонт, нежно окрашивая небо в золотисто-розовые оттенки, Азиза сидела на старой деревянной скамье рядом со своим магазином Azi Flowers. Она всегда любила этот момент — тишину, когда городской шум затихал, а свет становился мягким и уютным.");
}

// Функция для покупки цветка
function buyFlower() {
    alert("Вы добавили цветок в корзину!");
}